Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/Barsmiko1/orion-atlantis-eks-deployment/25/default/default.tfplan"' in '/atlantis-data/repos/Barsmiko1/orion-atlantis-eks-deployment/25/default': exit status 1
✅ terraform.tfvars created - ready for plan

null_resource.example: Refreshing state... [id=8072732795150734593]
module.eks.aws_iam_role.node: Refreshing state... [id=atlantis-cluster-node-role]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0cfc5c9c1ba567536]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0574721186bfb8435]
module.iam_roles.data.aws_caller_identity.current: Reading...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-06f76480c14b039fd]
module.iam_roles.aws_iam_policy.atlantis: Refreshing state... [id=arn:aws:iam::443370674281:policy/atlantis-cluster-atlantis-policy]
module.eks.aws_iam_role.cluster: Refreshing state... [id=atlantis-cluster-cluster-role]
data.aws_caller_identity.current: Reading...
module.iam_roles.data.aws_caller_identity.current: Read complete after 0s [id=443370674281]
module.iam_roles.aws_iam_role.eks_admin: Refreshing state... [id=atlantis-cluster-eks-admin]
data.aws_caller_identity.current: Read complete after 0s [id=443370674281]
module.iam_roles.aws_iam_role.eks_readonly: Refreshing state... [id=atlantis-cluster-eks-readonly]
module.eks.aws_iam_role_policy_attachment.node_AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=atlantis-cluster-node-role-20250523113621591300000002]
module.eks.aws_iam_role_policy_attachment.node_AmazonEKSWorkerNodePolicy: Refreshing state... [id=atlantis-cluster-node-role-20250523113621759100000005]
module.eks.aws_iam_role_policy_attachment.node_AmazonEKS_CNI_Policy: Refreshing state... [id=atlantis-cluster-node-role-20250523113621593800000003]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-094a63a57382ca927]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f34c910cd589780e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b94c14fec8b65c95]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-001fb09b74e5ebb2b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09c282059af8877f2]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=atlantis-cluster-cluster-role-20250523113621645600000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController: Refreshing state... [id=atlantis-cluster-cluster-role-20250523113621551700000001]
module.iam_roles.aws_iam_role_policy.eks_admin: Refreshing state... [id=atlantis-cluster-eks-admin:atlantis-cluster-eks-admin-policy]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-08cd8816117ce8558]
module.iam_roles.aws_iam_role_policy.eks_readonly: Refreshing state... [id=atlantis-cluster-eks-readonly:atlantis-cluster-eks-readonly-policy]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0cc1087496b2ad42b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-090ab815bbe02d95b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-055997cad6cb61918]
module.eks.aws_eks_cluster.this: Refreshing state... [id=atlantis-cluster]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00d6f273dc424ea28]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09657015c081716c8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e57dd9d25ad7bdd4]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c58a409ac12edc41]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05e55d91bc67f4fc0]
module.eks.data.tls_certificate.eks: Reading...
module.eks.data.tls_certificate.eks: Read complete after 0s [id=213644035344c59e44dd4b37f3e17ae888eed9e0]
aws_iam_role.ebs_csi_driver: Refreshing state... [id=atlantis-cluster-ebs-csi-driver]
module.iam_roles.aws_iam_role.atlantis: Refreshing state... [id=atlantis-cluster-atlantis-role]
module.eks.aws_eks_node_group.this: Refreshing state... [id=atlantis-cluster:atlantis-cluster-node-group]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::443370674281:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/DC71F8E2D326FB60A54C9807509323B6]
module.iam_roles.aws_iam_role_policy_attachment.atlantis: Refreshing state... [id=atlantis-cluster-atlantis-role-2025052311433299310000000c]
aws_iam_role_policy_attachment.ebs_csi_driver: Refreshing state... [id=atlantis-cluster-ebs-csi-driver-2025052311433310450000000d]
aws_eks_addon.ebs_csi_driver: Refreshing state... [id=atlantis-cluster:aws-ebs-csi-driver]
module.atlantis.kubernetes_namespace.atlantis: Refreshing state... [id=atlantis]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # kubernetes_annotations.ebs_default will be created
  + resource "kubernetes_annotations" "ebs_default" {
      + annotations   = {
          + "storageclass.kubernetes.io/is-default-class" = "true"
        }
      + api_version   = "storage.k8s.io/v1"
      + field_manager = "Terraform"
      + id            = (known after apply)
      + kind          = "StorageClass"

      + metadata {
          + name = "ebs-sc"
        }
    }

  # kubernetes_storage_class.ebs will be created
  + resource "kubernetes_storage_class" "ebs" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "fsType" = "ext4"
          + "type"   = "gp3"
        }
      + reclaim_policy         = "Retain"
      + storage_provisioner    = "ebs.csi.aws.com"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + generation       = (known after apply)
          + name             = "ebs-sc"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.iam_roles.kubernetes_cluster_role_binding.admin will be created
  + resource "kubernetes_cluster_role_binding" "admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-admin-binding"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "eks-admin"
          + namespace = "default"
        }
    }

  # module.iam_roles.kubernetes_cluster_role_binding.readonly will be created
  + resource "kubernetes_cluster_role_binding" "readonly" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-readonly-binding"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "view"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "eks-readonly"
          + namespace = "default"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: Get "https://DC71F8E2D326FB60A54C9807509323B6.gr7.us-west-2.eks.amazonaws.com/api/v1/namespaces/atlantis": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with module.atlantis.kubernetes_namespace.atlantis,
│   on modules/atlantis/main.tf line 1, in resource "kubernetes_namespace" "atlantis":
│    1: resource "kubernetes_namespace" "atlantis" {
│ 
╵


```
</details>